
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Товары Приход
	Движения.Товары.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Товары.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Номенклатура;
		Движение.Размер = ТекСтрокаТовары.Размер;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;    

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Поставщики") Тогда
		// Заполнение шапки
		ИНН = ДанныеЗаполнения.ИНН;
		Контрагент = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
	Ответственный =  ПараметрыСеанса.ТекущийСотрудник;  
	Склад = Константы.Склад.Получить();

КонецПроцедуры
