#Область ОбработчикиЭлементовТабличнойЧастиТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры    

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.Цена = ПолучитьЦену(ТекДанные.Номенклатура, Объект.Дата);  
	РассчитатьСумму();
КонецПроцедуры   

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСумму()
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьЦену(Товар, Дата)
	Возврат РегистрыСведений.Цены.ПолучитьПоследнее(Дата, Новый Структура("Товар",Товар )).Цена 
КонецФункции

&НаСервереБезКонтекста
Функция КонтрагентПриИзмененииНаСервере(Контрагент)
	Возврат Контрагент.ЧерныйСписок
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если КонтрагентПриИзмененииНаСервере(Объект.Контрагент) тогда
		Сообщить(СтрШаблон("Поставщик %1 находится в черном списке!", Объект.Контрагент));
		Объект.Контрагент = Неопределено;
	Иначе 
		объект.ИНН = ПолучитьИНН(Объект.Контрагент);
	КонецЕсли;
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьИНН(Контрагент)
	Возврат Контрагент.ИНН
КонецФункции 

#КонецОбласти




